app/views/users/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 1]]
---
<ul class="nav nav-tabs">
  <li class="active"><a data-toggle="tab" href="#Posts">Posts (<%= @user.posts.count %>)</a></li>
  <li><a data-toggle="tab" href="#Comments">Comments (<%= @user.comments.count %>)</a></li>