app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(params.require(:comment).permit (:body))
    @comment.creator = User.first #TODO: fix after authentication

    if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."id" ASC LIMIT 1  [["id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "I actually like this post a lot!"], ["created_at", Tue, 12 Aug 2014 12:54:43 UTC +00:00], ["post_id", 1], ["updated_at", Tue, 12 Aug 2014 12:54:43 UTC +00:00], ["user_id", 1]]