app/controllers/posts_controller.rb

  def index
    @posts = Post.all.sort_by{|x| x.total_votes}.reverse
---
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new(post_params)
    @post.creator = current_user

    if @post.save
---
INSERT INTO "posts" ("created_at", "description", "title", "updated_at", "url") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 09 Aug 2014 18:04:59 UTC +00:00], ["description", "Is it working now?"], ["title", "Testing 3"], ["updated_at", Sat, 09 Aug 2014 18:04:59 UTC +00:00], ["url", "www.stuff.com"]]

  def update
    @post.category_ids = params[:category_ids]
    if @post.update(post_params)
---
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["description", "I had to re-write this description."], ["updated_at", Sat, 09 Aug 2014 20:17:36 UTC +00:00]]

  def vote
    @vote = Vote.create(voteable: @post, creator: current_user, vote: params[:vote])
---
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Fri, 22 Aug 2014 15:30:52 UTC +00:00], ["updated_at", Fri, 22 Aug 2014 15:30:52 UTC +00:00], ["user_id", 1], ["vote", true], ["voteable_id", 1], ["voteable_type", "Post"]]